#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
tls_private_key.wiz_key: Refreshing state... [id=f774171bcfeac0f1fc031e3346635704673d429a]
data.aws_caller_identity.current: Reading...
aws_cloudwatch_log_group.wiz_eks_log_group: Refreshing state... [id=/aws/eks/wiz-eks-cluster/cluster]
aws_kms_key.wiz_eks_kms_key: Refreshing state... [id=ce6f92d7-2d4e-4e76-bac9-041a77bee855]
data.aws_ami.wiz_bastion_ami: Reading...
aws_iam_role.wiz_eks_node_group_role: Refreshing state... [id=wiz-eks-node-group-role]
data.aws_availability_zones.available: Reading...
aws_key_pair.wiz_key_pair: Refreshing state... [id=wiz-eks-key-pair]
data.aws_ami.amazon_linux: Reading...
data.aws_region.current: Reading...
aws_iam_role.wiz_eks_cluster_role: Refreshing state... [id=wiz-eks-cluster-role]
data.aws_region.current: Read complete after 0s [id=us-west-2]
data.aws_caller_identity.current: Read complete after 0s [id=571600872795]
aws_iam_role_policy_attachment.wiz_eks_cluster_policy: Refreshing state... [id=wiz-eks-cluster-role-20250821163711654500000007]
aws_iam_role_policy_attachment.wiz_eks_vpc_resource_controller: Refreshing state... [id=wiz-eks-cluster-role-20250821163711720300000008]
aws_iam_role_policy_attachment.wiz_eks_cni_policy: Refreshing state... [id=wiz-eks-node-group-role-20250821163711542800000005]
aws_iam_role_policy_attachment.wiz_ec2_container_registry_read_only: Refreshing state... [id=wiz-eks-node-group-role-20250821163711446700000004]
aws_iam_role_policy_attachment.wiz_eks_worker_node_policy: Refreshing state... [id=wiz-eks-node-group-role-20250821163711583200000006]
data.aws_availability_zones.available: Read complete after 1s [id=us-west-2]
data.aws_ami.amazon_linux: Read complete after 1s [id=ami-0bbc328167dee8f3c]
data.aws_ami.wiz_bastion_ami: Read complete after 1s [id=ami-0bbc328167dee8f3c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "cluster" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "wiz-eks-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = "wiz-eks-cluster"
      + token = (sensitive value)
    }

  # data.tls_certificate.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # aws_cloudwatch_log_group.wiz_eks_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "wiz_eks_log_group" {
        id                = "/aws/eks/wiz-eks-cluster/cluster"
        name              = "/aws/eks/wiz-eks-cluster/cluster"
      ~ retention_in_days = 30 -> 7
        tags              = {
            "Name"    = "wiz-eks-log-group"
            "purpose" = "wiz"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_eip.wiz_nat_eip will be created
  + resource "aws_eip" "wiz_nat_eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"    = "wiz-nat-eip"
          + "purpose" = "wiz"
        }
      + tags_all             = {
          + "Name"    = "wiz-nat-eip"
          + "purpose" = "wiz"
        }
      + vpc                  = (known after apply)
    }

  # aws_eks_cluster.wiz_cluster will be created
  + resource "aws_eks_cluster" "wiz_cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "wiz-eks-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::571600872795:role/wiz-eks-cluster-role"
      + status                        = (known after apply)
      + tags                          = {
          + "Name"    = "wiz-eks-cluster"
          + "purpose" = "wiz"
        }
      + tags_all                      = {
          + "Name"    = "wiz-eks-cluster"
          + "purpose" = "wiz"
        }
      + version                       = "1.28"

      + access_config (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = "arn:aws:kms:us-west-2:571600872795:key/ce6f92d7-2d4e-4e76-bac9-041a77bee855"
            }
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.wiz_node_group will be created
  + resource "aws_eks_node_group" "wiz_node_group" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "wiz-eks-cluster"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + labels                 = {
          + "env"  = "production"
          + "role" = "worker"
        }
      + node_group_name        = "wiz-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::571600872795:role/wiz-eks-node-group-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name"    = "wiz-node-group"
          + "purpose" = "wiz"
        }
      + tags_all               = {
          + "Name"    = "wiz-node-group"
          + "purpose" = "wiz"
        }
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + remote_access {
          + ec2_ssh_key               = "wiz-eks-key-pair"
          + source_security_group_ids = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_instance_profile.wiz_bastion_instance_profile will be created
  + resource "aws_iam_instance_profile" "wiz_bastion_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "wiz-bastion-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "wiz-bastion-eks-role"
      + tags        = {
          + "Name"    = "wiz-bastion-instance-profile"
          + "purpose" = "wiz"
        }
      + tags_all    = {
          + "Name"    = "wiz-bastion-instance-profile"
          + "purpose" = "wiz"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.wiz_eks_node_instance_profile will be created
  + resource "aws_iam_instance_profile" "wiz_eks_node_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "wiz-eks-node-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "wiz-eks-node-group-role"
      + tags        = {
          + "Name"    = "wiz-eks-node-instance-profile"
          + "purpose" = "wiz"
        }
      + tags_all    = {
          + "Name"    = "wiz-eks-node-instance-profile"
          + "purpose" = "wiz"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.wiz_postgres_instance_profile will be created
  + resource "aws_iam_instance_profile" "wiz_postgres_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "wiz-postgres-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "wiz-postgres-ec2-role"
      + tags        = {
          + "Name"    = "wiz-postgres-instance-profile"
          + "purpose" = "wiz"
        }
      + tags_all    = {
          + "Name"    = "wiz-postgres-instance-profile"
          + "purpose" = "wiz"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_openid_connect_provider.cluster will be created
  + resource "aws_iam_openid_connect_provider" "cluster" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name"    = "wiz-eks-oidc-provider"
          + "purpose" = "wiz"
        }
      + tags_all        = {
          + "Name"    = "wiz-eks-oidc-provider"
          + "purpose" = "wiz"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # aws_iam_policy.wiz_bastion_eks_policy will be created
  + resource "aws_iam_policy" "wiz_bastion_eks_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Full EKS cluster access policy for bastion host"
      + id               = (known after apply)
      + name             = "wiz-bastion-eks-full-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:*",
                          + "iam:PassRole",
                          + "iam:ListRoles",
                          + "iam:ListRolePolicies",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:GetRole",
                          + "iam:GetRolePolicy",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "sts:GetCallerIdentity",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name"    = "wiz-bastion-eks-full-access"
          + "purpose" = "wiz"
        }
      + tags_all         = {
          + "Name"    = "wiz-bastion-eks-full-access"
          + "purpose" = "wiz"
        }
    }

  # aws_iam_policy.wiz_postgres_custom_policy will be created
  + resource "aws_iam_policy" "wiz_postgres_custom_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Custom policy for PostgreSQL instance with S3 and EC2 permissions"
      + id               = (known after apply)
      + name             = "wiz-postgres-custom-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "ec2:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name"    = "wiz-postgres-custom-policy"
          + "purpose" = "wiz"
        }
      + tags_all         = {
          + "Name"    = "wiz-postgres-custom-policy"
          + "purpose" = "wiz"
        }
    }

  # aws_iam_role.service_account_role will be created
  + resource "aws_iam_role" "service_account_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wiz-eks-service-account-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"    = "wiz-eks-service-account-role"
          + "purpose" = "wiz"
        }
      + tags_all              = {
          + "Name"    = "wiz-eks-service-account-role"
          + "purpose" = "wiz"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.wiz_bastion_role will be created
  + resource "aws_iam_role" "wiz_bastion_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wiz-bastion-eks-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"    = "wiz-bastion-eks-role"
          + "purpose" = "wiz"
        }
      + tags_all              = {
          + "Name"    = "wiz-bastion-eks-role"
          + "purpose" = "wiz"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.wiz_postgres_role will be created
  + resource "aws_iam_role" "wiz_postgres_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wiz-postgres-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"    = "wiz-postgres-ec2-role"
          + "purpose" = "wiz"
        }
      + tags_all              = {
          + "Name"    = "wiz-postgres-ec2-role"
          + "purpose" = "wiz"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.service_account_policy will be created
  + resource "aws_iam_role_policy_attachment" "service_account_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"
      + role       = "wiz-eks-service-account-role"
    }

  # aws_iam_role_policy_attachment.wiz_bastion_eks_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "wiz_bastion_eks_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "wiz-bastion-eks-role"
    }

  # aws_iam_role_policy_attachment.wiz_bastion_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "wiz_bastion_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "wiz-bastion-eks-role"
    }

  # aws_iam_role_policy_attachment.wiz_eks_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "wiz_eks_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "wiz-eks-node-group-role"
    }

  # aws_iam_role_policy_attachment.wiz_postgres_cloudwatch_policy will be created
  + resource "aws_iam_role_policy_attachment" "wiz_postgres_cloudwatch_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
      + role       = "wiz-postgres-ec2-role"
    }

  # aws_iam_role_policy_attachment.wiz_postgres_custom_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "wiz_postgres_custom_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "wiz-postgres-ec2-role"
    }

  # aws_iam_role_policy_attachment.wiz_postgres_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "wiz_postgres_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "wiz-postgres-ec2-role"
    }

  # aws_instance.wiz_bastion will be created
  + resource "aws_instance" "wiz_bastion" {
      + ami                                  = "ami-0bbc328167dee8f3c"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "wiz-bastion-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "wiz-bastion-key-pair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"    = "wiz-bastion-host"
          + "purpose" = "wiz"
        }
      + tags_all                             = {
          + "Name"    = "wiz-bastion-host"
          + "purpose" = "wiz"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "54525a7d88fe7aac2f09b7fbbe06e5a1196e36db"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name"    = "wiz-bastion-root-volume"
              + "purpose" = "wiz"
            }
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # aws_instance.wiz_postgres will be created
  + resource "aws_instance" "wiz_postgres" {
      + ami                                  = "ami-0bbc328167dee8f3c"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "wiz-postgres-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "wiz-postgres-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"    = "wiz-postgres-instance"
          + "Type"    = "database"
          + "purpose" = "wiz"
        }
      + tags_all                             = {
          + "Name"    = "wiz-postgres-instance"
          + "Type"    = "database"
          + "purpose" = "wiz"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = "gp3"
        }
    }

  # aws_internet_gateway.wiz_igw will be created
  + resource "aws_internet_gateway" "wiz_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "wiz-igw"
          + "purpose" = "wiz"
        }
      + tags_all = {
          + "Name"    = "wiz-igw"
          + "purpose" = "wiz"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.wiz_bastion_key_pair will be created
  + resource "aws_key_pair" "wiz_bastion_key_pair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "wiz-bastion-key-pair"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "Name"    = "wiz-bastion-key-pair"
          + "purpose" = "wiz"
        }
      + tags_all        = {
          + "Name"    = "wiz-bastion-key-pair"
          + "purpose" = "wiz"
        }
    }

  # aws_key_pair.wiz_postgres_key will be created
  + resource "aws_key_pair" "wiz_postgres_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "wiz-postgres-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "Name"    = "wiz-postgres-key"
          + "purpose" = "wiz"
        }
      + tags_all        = {
          + "Name"    = "wiz-postgres-key"
          + "purpose" = "wiz"
        }
    }

  # aws_kms_alias.wiz_eks_kms_alias will be created
  + resource "aws_kms_alias" "wiz_eks_kms_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/wiz-eks-kms-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "ce6f92d7-2d4e-4e76-bac9-041a77bee855"
    }

  # aws_nat_gateway.wiz_nat_gateway will be created
  + resource "aws_nat_gateway" "wiz_nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"    = "wiz-nat-gateway"
          + "purpose" = "wiz"
        }
      + tags_all                           = {
          + "Name"    = "wiz-nat-gateway"
          + "purpose" = "wiz"
        }
    }

  # aws_route_table.wiz_private_rt will be created
  + resource "aws_route_table" "wiz_private_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"    = "wiz-private-route-table"
          + "purpose" = "wiz"
        }
      + tags_all         = {
          + "Name"    = "wiz-private-route-table"
          + "purpose" = "wiz"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.wiz_public_rt will be created
  + resource "aws_route_table" "wiz_public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"    = "wiz-public-route-table"
          + "purpose" = "wiz"
        }
      + tags_all         = {
          + "Name"    = "wiz-public-route-table"
          + "purpose" = "wiz"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.wiz_private_rta[0] will be created
  + resource "aws_route_table_association" "wiz_private_rta" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.wiz_private_rta[1] will be created
  + resource "aws_route_table_association" "wiz_private_rta" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.wiz_public_rta[0] will be created
  + resource "aws_route_table_association" "wiz_public_rta" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.wiz_public_rta[1] will be created
  + resource "aws_route_table_association" "wiz_public_rta" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.wiz_postgres_backups will be created
  + resource "aws_s3_bucket" "wiz_postgres_backups" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"    = "wiz-postgres-backups"
          + "purpose" = "wiz"
        }
      + tags_all                    = {
          + "Name"    = "wiz-postgres-backups"
          + "purpose" = "wiz"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_policy.wiz_postgres_backups_policy will be created
  + resource "aws_s3_bucket_policy" "wiz_postgres_backups_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.wiz_postgres_backups_pab will be created
  + resource "aws_s3_bucket_public_access_block" "wiz_postgres_backups_pab" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # aws_s3_bucket_server_side_encryption_configuration.wiz_postgres_backups_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "wiz_postgres_backups_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.wiz_postgres_backups_versioning will be created
  + resource "aws_s3_bucket_versioning" "wiz_postgres_backups_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_security_group.wiz_bastion_sg will be created
  + resource "aws_security_group" "wiz_bastion_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for bastion host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "wiz-bastion-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "wiz-bastion-sg"
          + "purpose" = "wiz"
        }
      + tags_all               = {
          + "Name"    = "wiz-bastion-sg"
          + "purpose" = "wiz"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.wiz_eks_cluster_sg will be created
  + resource "aws_security_group" "wiz_eks_cluster_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "wiz-eks-cluster-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "wiz-eks-cluster-sg"
          + "purpose" = "wiz"
        }
      + tags_all               = {
          + "Name"    = "wiz-eks-cluster-sg"
          + "purpose" = "wiz"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.wiz_eks_nodes_sg will be created
  + resource "aws_security_group" "wiz_eks_nodes_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS worker nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Cluster API to node groups"
              + from_port        = 1025
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = []
              + description      = "Cluster API to node kubelets"
              + from_port        = 10250
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 10250
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node communication UDP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = true
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node communication"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 65535
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "wiz-eks-nodes-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "wiz-eks-nodes-sg"
          + "purpose" = "wiz"
        }
      + tags_all               = {
          + "Name"    = "wiz-eks-nodes-sg"
          + "purpose" = "wiz"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.wiz_postgres_sg will be created
  + resource "aws_security_group" "wiz_postgres_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for PostgreSQL EC2 instance"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "PostgreSQL from EKS nodes"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = "PostgreSQL from bastion"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = "SSH from bastion"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "wiz-postgres-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "wiz-postgres-sg"
          + "purpose" = "wiz"
        }
      + tags_all               = {
          + "Name"    = "wiz-postgres-sg"
          + "purpose" = "wiz"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.wiz_allow_bastion_to_nodes will be created
  + resource "aws_security_group_rule" "wiz_allow_bastion_to_nodes" {
      + description              = "Allow SSH from bastion to EKS nodes"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # aws_security_group_rule.wiz_cluster_ingress_node_https will be created
  + resource "aws_security_group_rule" "wiz_cluster_ingress_node_https" {
      + description              = "Allow nodes to communicate with cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_subnet.wiz_private_subnets[0] will be created
  + resource "aws_subnet" "wiz_private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                  = "wiz-private-subnet-1"
          + "Type"                                  = "Private"
          + "kubernetes.io/cluster/wiz-eks-cluster" = "owned"
          + "kubernetes.io/role/internal-elb"       = "1"
          + "purpose"                               = "wiz"
        }
      + tags_all                                       = {
          + "Name"                                  = "wiz-private-subnet-1"
          + "Type"                                  = "Private"
          + "kubernetes.io/cluster/wiz-eks-cluster" = "owned"
          + "kubernetes.io/role/internal-elb"       = "1"
          + "purpose"                               = "wiz"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.wiz_private_subnets[1] will be created
  + resource "aws_subnet" "wiz_private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                  = "wiz-private-subnet-2"
          + "Type"                                  = "Private"
          + "kubernetes.io/cluster/wiz-eks-cluster" = "owned"
          + "kubernetes.io/role/internal-elb"       = "1"
          + "purpose"                               = "wiz"
        }
      + tags_all                                       = {
          + "Name"                                  = "wiz-private-subnet-2"
          + "Type"                                  = "Private"
          + "kubernetes.io/cluster/wiz-eks-cluster" = "owned"
          + "kubernetes.io/role/internal-elb"       = "1"
          + "purpose"                               = "wiz"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.wiz_public_subnets[0] will be created
  + resource "aws_subnet" "wiz_public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                  = "wiz-public-subnet-1"
          + "Type"                                  = "Public"
          + "kubernetes.io/cluster/wiz-eks-cluster" = "owned"
          + "kubernetes.io/role/elb"                = "1"
          + "purpose"                               = "wiz"
        }
      + tags_all                                       = {
          + "Name"                                  = "wiz-public-subnet-1"
          + "Type"                                  = "Public"
          + "kubernetes.io/cluster/wiz-eks-cluster" = "owned"
          + "kubernetes.io/role/elb"                = "1"
          + "purpose"                               = "wiz"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.wiz_public_subnets[1] will be created
  + resource "aws_subnet" "wiz_public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                  = "wiz-public-subnet-2"
          + "Type"                                  = "Public"
          + "kubernetes.io/cluster/wiz-eks-cluster" = "owned"
          + "kubernetes.io/role/elb"                = "1"
          + "purpose"                               = "wiz"
        }
      + tags_all                                       = {
          + "Name"                                  = "wiz-public-subnet-2"
          + "Type"                                  = "Public"
          + "kubernetes.io/cluster/wiz-eks-cluster" = "owned"
          + "kubernetes.io/role/elb"                = "1"
          + "purpose"                               = "wiz"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.wiz_vpc will be created
  + resource "aws_vpc" "wiz_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"                                  = "wiz-vpc"
          + "kubernetes.io/cluster/wiz-eks-cluster" = "shared"
          + "purpose"                               = "wiz"
        }
      + tags_all                             = {
          + "Name"                                  = "wiz-vpc"
          + "kubernetes.io/cluster/wiz-eks-cluster" = "shared"
          + "purpose"                               = "wiz"
        }
    }

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "applicationSet":
                  "enabled": true
                "configs":
                  "params":
                    "server.insecure": true
                "controller":
                  "replicas": 1
                "global":
                  "domain": "argocd.local"
                "redis":
                  "enabled": true
                "repoServer":
                  "replicas": 1
                "server":
                  "ingress":
                    "enabled": false
                  "service":
                    "annotations":
                      "service.beta.kubernetes.io/aws-load-balancer-scheme": "internet-facing"
                      "service.beta.kubernetes.io/aws-load-balancer-type": "nlb"
                    "type": "LoadBalancer"
            EOT,
        ]
      + verify                     = false
      + version                    = "5.51.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_config_map_v1_data.aws_auth will be created
  + resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = (known after apply)
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

  # kubernetes_namespace.argocd will be created
  + resource "kubernetes_namespace" "argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.secrets will be created
  + resource "kubernetes_namespace" "secrets" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.postgres_secret will be created
  + resource "kubernetes_secret" "postgres_secret" {
      + binary_data_wo                 = (write-only attribute)
      + data                           = (sensitive value)
      + data_wo                        = (write-only attribute)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "postgres-secret"
          + namespace        = "secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.wiz_service_account will be created
  + resource "kubernetes_service_account" "wiz_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "wiz-service-account"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # local_file.wiz_bastion_private_key will be created
  + resource "local_file" "wiz_bastion_private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "./wiz-bastion-key.pem"
      + id                   = (known after apply)
    }

  # local_file.wiz_private_key will be created
  + resource "local_file" "wiz_private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "./wiz-eks-key.pem"
      + id                   = (known after apply)
    }

  # null_resource.argo_application will be created
  + resource "null_resource" "argo_application" {
      + id = (known after apply)
    }

  # random_password.postgres_password will be created
  + resou
...
[Output truncated]
```

</details>

*Pusher: @jeffellin, Action: `pull_request`*